GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307v(g-e-c)xx-pinctrl.h
/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, NORMP)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, NORMP)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, NORMP)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, NORMP)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AFIO('E', 0, ALTERNATE, NORMP)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AFIO('E', 1, ALTERNATE, NORMP)

/* EXMC_NCE1 */
#define EXMC_NCE1_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NE0 */
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NOE */
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, NORMP)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AFIO('D', 6, ALTERNATE, NORMP)

/* EXMC_NWE */
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6_INP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)
#define I2S1_MCK_PC6_OUT \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7_INP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)
#define I2S2_MCK_PC7_OUT \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_NORMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PC12_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

/* I2S2_WS */
#define I2S2_WS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AFIO('C', 14, GPIO_IN, NORMP)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AFIO('C', 15, GPIO_IN, NORMP)

/* PA13 */
#define PA13_PA13 \
	GD32_PINMUX_AFIO('A', 13, ALTERNATE, NORMP)

/* PA14 */
#define PA14_PA14 \
	GD32_PINMUX_AFIO('A', 14, ALTERNATE, NORMP)

/* PA15 */
#define PA15_PA15 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SPI1_NSS */
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SPI1_SCK */
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PC11_NORMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PC11_RMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_RMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_RMP)

/* SPI2_NSS */
#define SPI2_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)
#define SPI2_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)

