GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307v(g-e-c)xx-pinctrl.h
/* SPI2_SCK */
#define SPI2_SCK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_RMP)

/* TAMPER-RTC */
#define TAMPER-RTC_PC13 \
	GD32_PINMUX_AFIO('C', 13, ALTERNATE, NORMP)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER0_NORMP)
#define TIMER0_BRKIN_PA6_PRMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER0_PRMP)
#define TIMER0_BRKIN_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, TIMER0_NORMP)
#define TIMER0_BRKIN_PE15_NORMP \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_BRKIN_PE15_FRMP \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PE9_NORMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PE9_RMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_RMP)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PA7_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_ON_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PE8_NORMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PE8_FRMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PE11_NORMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PE11_RMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_RMP)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB0_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_ON_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PE10_NORMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PE10_FRMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PE13_NORMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PE13_RMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_RMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_ON_PB15_NORMP \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PE12_NORMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PE12_FRMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PE14_NORMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PE14_RMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_RMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PE7_NORMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PE7_RMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_RMP)

/* TIMER10_CH0 */
#define TIMER10_CH0_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER10_NORMP)

/* TIMER11_CH0 */
#define TIMER11_CH0_PB14 \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* TIMER11_CH1 */
#define TIMER11_CH1_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER12_NORMP)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER13_NORMP)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA15_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_RMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PB3_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_RMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PB10_RMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_RMP)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PB11_RMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_RMP)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA15_RMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_RMP)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_FRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_FRMP)
#define TIMER2_CH0_PC6_NORMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PC6_PRMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_FRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_FRMP)
#define TIMER2_CH1_PC7_NORMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PC7_PRMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PC8_NORMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PC8_RMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_RMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PC9_NORMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PC9_RMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_RMP)

