GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307v(g-e-c)xx-pinctrl.h
/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH0_PD12_NORMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH0_PD12_RMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH1_PD13_NORMP \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH1_PD13_RMP \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH2_PD14_NORMP \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH2_PD14_RMP \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH3_PD15_NORMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH3_PD15_RMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, TIMER3_RMP)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AFIO('E', 0, GPIO_IN, NORMP)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, NORMP)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH0_PE5_NORMP \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH0_PE5_RMP \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, TIMER8_RMP)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH1_PE6_NORMP \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH1_PE6_RMP \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, TIMER8_RMP)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER9_NORMP)

/* TRACECK */
#define TRACECK_PE2 \
	GD32_PINMUX_AFIO('E', 2, ALTERNATE, NORMP)

/* TRACED0 */
#define TRACED0_PE3 \
	GD32_PINMUX_AFIO('E', 3, ALTERNATE, NORMP)

/* TRACED1 */
#define TRACED1_PE4 \
	GD32_PINMUX_AFIO('E', 4, ALTERNATE, NORMP)

/* TRACED2 */
#define TRACED2_PE5 \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, NORMP)

/* TRACED3 */
#define TRACED3_PE6 \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, NORMP)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, NORMP)

/* UART3_RX */
#define UART3_RX_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* UART3_TX */
#define UART3_TX_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)
#define USART1_CK_PD7_NORMP \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, USART1_NORMP)
#define USART1_CK_PD7_RMP \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, USART1_RMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)
#define USART1_CTS_PD3_NORMP \
	GD32_PINMUX_AFIO('D', 3, GPIO_IN, USART1_NORMP)
#define USART1_CTS_PD3_RMP \
	GD32_PINMUX_AFIO('D', 3, GPIO_IN, USART1_RMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)
#define USART1_RTS_PD4_NORMP \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, USART1_NORMP)
#define USART1_RTS_PD4_RMP \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, USART1_RMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)
#define USART1_RX_PD6_NORMP \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, USART1_NORMP)
#define USART1_RX_PD6_RMP \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, USART1_RMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)
#define USART1_TX_PD5_NORMP \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, USART1_NORMP)
#define USART1_TX_PD5_RMP \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, USART1_RMP)

/* USART2_CK */
#define USART2_CK_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_PRMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_PRMP)
#define USART2_CK_PD10_NORMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_NORMP)
#define USART2_CK_PD10_FRMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_FRMP)

/* USART2_CTS */
#define USART2_CTS_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PD11_NORMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PD11_RMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_RMP)

