GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307v(g-e-c)xx-pinctrl.h
/* USART2_RTS */
#define USART2_RTS_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PD12_NORMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PD12_RMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_RMP)

/* USART2_RX */
#define USART2_RX_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_NORMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_PRMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_PRMP)
#define USART2_RX_PD9_NORMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_NORMP)
#define USART2_RX_PD9_FRMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_FRMP)

/* USART2_TX */
#define USART2_TX_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_PRMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_PRMP)
#define USART2_TX_PD8_NORMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_NORMP)
#define USART2_TX_PD8_FRMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_FRMP)

/* USBFS_DM */
#define USBFS_DM_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBFS_DP */
#define USBFS_DP_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USBFS_ID */
#define USBFS_ID_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBFS_VBUS */
#define USBFS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* WKUP */
#define WKUP_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
